tap "homebrew/bundle"
tap "anomalyco/tap"

# Core Binaries (Cross-Platform)
brew "git"
brew "opencode"                # AI Agent
brew "starship"                # Prompt
brew "fnm"                     # Node manager
brew "mcfly"                   # History search
brew "fzf"                     # Fuzzy finder
brew "lazygit"                 # Git UI
brew "zsh-syntax-highlighting" # Shell syntax highlighting

# Editor & Dependencies (LazyVim)
brew "neovim"
brew "ripgrep"                 # Fast grep (required by Telescope)
brew "fd"                      # Fast find (required by Telescope)

# Modern CLI Tools
brew "tealdeer"                # Fast tldr (man pages)
brew "zoxide"                  # Smarter cd
brew "eza"                     # Modern ls
brew "bat"                     # Modern cat
brew "git-delta"               # Modern git diff

# Terminal UIs
brew "lazydocker"
brew "btop"
brew "yazi"
brew "sevenzip"                # Archive support for Yazi

# Productivity & Safety
brew "trash-cli"               # Safe deletion (aliased to del)

# macOS Specifics
if OS.mac?
  cask "wezterm"
  cask "font-jetbrains-mono-nerd-font"
end


